packages/foamlib/foamlib-1.1.4.tar.gz/foamlib-1.1.4/tests/test_preprocessing/templates/damBreak/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
